#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/give-back-cincinnati/gbc-infra/runs/run-NGZqhcSJWD3ACiVY

Waiting for the plan to start...

Terraform v1.2.6
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zones.gbc: Reading...
data.cloudflare_zones.gbc: Read complete after 1s [id=86d947abd1990f315eb415450516882e]
cloudflare_record.gbc_next: Refreshing state... [id=a5db23132cde2c5180bb31b3609bb469]
cloudflare_page_rule.www_redirect: Refreshing state... [id=82e0b98b0e7ba0a373f495bfea3d464f]
cloudflare_zone_settings_override.gbc_dev_settings: Refreshing state... [id=f746dcf37d3a9a454301a1744e99af3b]
azurerm_resource_group.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources]
azurerm_virtual_network.gbc_vnet: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.Network/virtualNetworks/gbc-vnet]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.ContainerRegistry/registries/gbcCR]
azurerm_subnet.gbc_subnet: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.Network/virtualNetworks/gbc-vnet/subnets/gbc-subnet]
azurerm_kubernetes_cluster.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourcegroups/gbc-resources/providers/Microsoft.ContainerService/managedClusters/gbc-aks]
data.azurerm_resource_group.aks_resource_group: Reading...
kubernetes_namespace.vault: Refreshing state... [id=vault]
kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
kubernetes_namespace.stage: Refreshing state... [id=stage]
kubernetes_namespace.prod: Refreshing state... [id=prod]
kubernetes_namespace.ingress: Refreshing state... [id=ingress-nginx]
kubernetes_namespace.new_relic: Refreshing state... [id=new-relic]
data.azurerm_resource_group.aks_resource_group: Read complete after 0s [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/MC_gbc-resources_gbc-aks_eastus]
azurerm_public_ip.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/MC_gbc-resources_gbc-aks_eastus/providers/Microsoft.Network/publicIPAddresses/gbcPublicIp]
helm_release.cert-manager: Refreshing state... [id=gbc]
helm_release.vault: Refreshing state... [id=gbc]
cloudflare_record.vault: Refreshing state... [id=61901e39fc7cb7999a271d4d732f8ecb]
cloudflare_record.gbc_api: Refreshing state... [id=10ffaed1b982a77ffb8a27224edda9da]
helm_release.nginx_ingress: Refreshing state... [id=gbc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.mongodb will be created
  + resource "helm_release" "mongodb" {
      + atomic                     = false
      + chart                      = "mongodb"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gbc"
      + namespace                  = "prod"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "13.0.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "architecture"
          + value = "replicaset"
        }
      + set {
          + name  = "auth.databases.0"
          + value = "index"
        }
      + set {
          + name  = "auth.passwords.0"
          + value = "hello_world"
        }
      + set {
          + name  = "auth.usernames.0"
          + value = "prod"
        }
      + set {
          + name  = "resources.limits.cpu"
          + value = "100m"
        }
      + set {
          + name  = "resources.limits.memory"
          + value = "128Mi"
        }
      + set {
          + name  = "resources.requests.cpu"
          + value = "100m"
        }
      + set {
          + name  = "resources.requests.memory"
          + value = "128Mi"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @MYoung25, Action: `pull_request`*